Revit 2027 API
ParameterTypeId.CurveNumberOfSegments Property
 "Number of Full Segments"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveNumberOfSegments { get; }
Public Shared ReadOnly Property CurveNumberOfSegments As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveNumberOfSegments {
	ForgeTypeId^ get ();
}
static member CurveNumberOfSegments : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace